class DBManager:
    """Класс для работы с БД посредством SQL-запросов"""

    def get_companies_and_vacancies_count
        """Получает список всех компаний и количество вакансий у каждой компании."""

    def get_all_vacancies
        """Получает список всех вакансий с указанием названия компании,
                названия вакансии и зарплаты и ссылки на вакансию."""

    def get_avg_salary
        """Получает среднюю зарплату от, по вакансиям (среди тех где она указана)."""

    def get_vacancies_with_higher_salary
        """Получает список всех вакансий, у которых зарплата выше средней по всем вакансиям."""

    def get_vacancies_with_keyword
        """Получает список всех вакансий, в названии которых содержатся переданные в метод слова, например “python”"""

